evidencias/jmeter_reporte/statistics.json
{
  "" : {
    "transaction" : "",
    "sampleCount" : 150,
    "errorCount" : 1,
    "errorPct" : 0.6666667,
    "meanResTime" : 553.8800000000003,
    "medianResTime" : 554.0,
    "minResTime" : 156.0,
    "maxResTime" : 1710.0,
    "pct1ResTime" : 888.5,
    "pct2ResTime" : 1017.2499999999998,
    "pct3ResTime" : 1446.3300000000047,
    "throughput" : 12.595515996305316,
    "receivedKBytesPerSec" : 24.828418895373247,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 150,
    "errorCount" : 1,
    "errorPct" : 0.6666667,
    "meanResTime" : 553.8800000000003,
    "medianResTime" : 554.0,
    "minResTime" : 156.0,
    "maxResTime" : 1710.0,
    "pct1ResTime" : 888.5,
    "pct2ResTime" : 1017.2499999999998,
    "pct3ResTime" : 1446.3300000000047,
    "throughput" : 12.595515996305316,
    "receivedKBytesPerSec" : 24.828418895373247,
    "sentKBytesPerSec" : 0.0
  }
}